In [24]:
import random
import pandas as pd
import os
original_path = "datasets/merged_filtered.csv"
dataset = pd.read_csv(original_path, header=None)

In [25]:
dataset.shape

(17622266, 4)

In [27]:
dataset.head()

      0           1          2         3
0  3644  1201981259  116.37497  39.85789
1  3644  1201981331  116.37542  39.85764
2  3644  1201981369  116.37727  39.85775
3  3644  1201981379  116.37746  39.85787
4  3644  1201981440  116.37749  39.85817

In [28]:
dataset.columns = ['id', 'timestamp', 'longitude', 'lattitude']

In [29]:
shuffled_df = dataset.sample(frac=1).reset_index(drop=True)

In [30]:
shuffled_df.head()

     id   timestamp  longitude  lattitude
0  4798  1202211480  116.34337   39.93422
1  9037  1202306255  116.32060   39.90038
2  8160  1202111253  116.43771   39.93977
3  8998  1202487964  116.33512   39.88810
4  7195  1202116722  116.34712   39.98520

In [31]:
shuffled_df.shape

(17622266, 4)

In [32]:

shuffled_path = "datasets/t_drive_merged_filtered_shuffled.csv"

In [35]:
shuffled_df.to_csv(shuffled_path)